#include <iostream>
#include <cmath>
using namespace std;

// =====================================================================
//  Proc47
//  ОПИС ЗАДАЧІ:
//  Описати функцію PowerInt(X, n) дійсного типу, яка обчислює степінь X^n
//  цілого числа n (n може бути від'ємним).
//  За допомогою цієї функції обчислити степені для трьох пар даних чисел X та n.
//  Умови: у функції та при її виклику не використовувати цикли.
//  Якщо X не входить у діапазон [-100, 100], вивести повідомлення про помилку.
// =====================================================================
double PowerInt(double X, int n);

// =====================================================================
//  Proc6
//  ОПИС ЗАДАЧІ:
//  Описати процедуру DigitCountSum(K, C, S), що знаходить кількість C цифр
//  цілого додатного числа K, а також їх суму S (K - вхідний, C і S - вихідні).
//  За допомогою цієї процедури знайти кількість і суму цифр для п'яти чисел.
//  Умови: у процедурі та при її виклику не використовувати цикли.
//  Якщо число виходить за межі [-100, 100], вивести повідомлення про помилку.
// =====================================================================
void DigitCountSum(int K, int &C, int &S);

// =====================================================================
//  Integer13
//  ОПИС ЗАДАЧІ:
//  Дано тризначне число. У ньому закреслили першу зліва цифру
//  і приписали її справа. Вивести отримане число.
//  
//  Реалізація через 4 функції:
//  1) in_N()  – введення з перевіркою коректності;
//  2) rotate_N() – обчислення результату;
//  3) out_res()  – виведення результату;
//  4) task_Int13() – повна задача (виклик попередніх функцій).
// =====================================================================
bool in_N(int &pN);   // введення з перевіркою
int rotate_N(int pN); // підрахунок
void out_res(int result); // виведення
void task_Int13(); // основна задача

int main() 
{
    // -------- Перша задача (Proc47) --------
    cout << "=== Proc47: PowerInt ===" << endl;
    double X1 = 2, X2 = -3, X3 = 5;
    int n1 = 3, n2 = -2, n3 = 0;

    if (fabs(X1) <= 100 && fabs(X2) <= 100 && fabs(X3) <= 100) 
    {
        cout << X1 << "^" << n1 << " = " << PowerInt(X1, n1) << endl;
        cout << X2 << "^" << n2 << " = " << PowerInt(X2, n2) << endl;
        cout << X3 << "^" << n3 << " = " << PowerInt(X3, n3) << endl;
    }
    else 
    {
        cout << "Error: X out of range [-100, 100]" << endl;
    }

    // -------- Друга задача (Proc6) --------
    cout << "\n=== Proc6: DigitCountSum ===" << endl;
    int numbers[5] = {5, 12, 345, 78, 999};

    for (int i = 0; i < 5; i++) 
    {
        int C = 0, S = 0;
        if (numbers[i] >= 0 && numbers[i] <= 100) 
        {
            DigitCountSum(numbers[i], C, S);
            cout << "Number: " << numbers[i]
                 << " -> Digits: " << C
                 << ", Sum: " << S << endl;
        }
        else 
        {
            cout << "Error: number " << numbers[i]
                 << " out of range [-100, 100]" << endl;
        }
    }

    // -------- Третя задача (Integer13) --------
    cout << "\n";
    task_Int13();

    return 0;
}

// =====================================================================
//  ВИЗНАЧЕННЯ ФУНКЦІЇ PowerInt
//  Рекурсивно обчислює X^n без циклів.
// =====================================================================
double PowerInt(double X, int n) 
{
    if (n == 0) return 1;          // будь-яке число в нульовому степені = 1
    if (n > 0) return X * PowerInt(X, n - 1);   // рекурсія для додатного n
    else return 1.0 / PowerInt(X, -n);          // якщо n від'ємне
}

// =====================================================================
//  ВИЗНАЧЕННЯ ПРОЦЕДУРИ DigitCountSum
//  Рекурсивно знаходить кількість цифр (C) і суму цифр (S) числа K.
// =====================================================================
void DigitCountSum(int K, int &C, int &S) 
{
    if (K == 0) 
    {
        if (C == 0) C = 1; // окремий випадок для числа 0
        return;
    }
    S += K % 10;           // додаємо останню цифру до суми
    C++;                   // збільшуємо лічильник цифр
    DigitCountSum(K / 10, C, S); // рекурсивний виклик для решти числа
}

// =====================================================================
//  Функція task_Int13()
//  Об'єднує всі етапи задачі:
//  - введення з перевіркою
//  - підрахунок результату
//  - виведення результату
// =====================================================================
void task_Int13() 
{
    int N; // змінна для числа

    cout << "=== Integer13 ===" << endl;

    // введення з перевіркою
    if (in_N(N)) 
    {
        cout << "Input error: N must be a three-digit integer!" << endl;
    } 
    else 
    {
        // підрахунок і виведення
        int result = rotate_N(N);
        out_res(result);
    }
}

// =====================================================================
//  Функція in_N()
//  Зчитує значення з консолі, перевіряє:
//  - чи це ціле число
//  - чи воно тризначне (від -999 до -100 або від 100 до 999)
//  Повертає true, якщо введення некоректне.
// =====================================================================
bool in_N(int &pN) 
{
    cout << "Enter a three-digit number N: ";
    cin >> pN;

    if (cin.fail()) 
    { // якщо введено не число
        cin.clear();
        cin.ignore(1000, '\n');
        return true;
    }

    if (abs(pN) < 100 || abs(pN) > 999) return true; // не тризначне

    return false; // все добре
}

// =====================================================================
//  Функція rotate_N()
//  Виконує "переміщення" першої цифри в кінець числа.
//  Наприклад: 123 -> 231, 987 -> 879
// =====================================================================
int rotate_N(int pN) 
{
    int sign = (pN < 0) ? -1 : 1; // зберігаємо знак
    pN = abs(pN);

    int first = pN / 100;      // перша цифра
    int lastTwo = pN % 100;    // останні дві цифри

    int result = lastTwo * 10 + first;
    return result * sign;
}

// =====================================================================
//  Функція out_res()
//  Виводить результат обчислення.
// =====================================================================
void out_res(int result) 
{
    cout << "Resulting number: " << result << endl;
}
